spec/support/fixtures/vcr_cassettes/CollectUnclaimedBalancesOfInactiveStripeAccountsJob/_perform/does_not_attempt_to_collect_balance_if_the_Stripe_account_is_considered_active_based_on_last_payout_date.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/accounts/acct_1SksUmIK1urmCqcP
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        hsc-m4-air.local 25.0.0 Darwin Kernel Version 25.0.0: Wed Sep 17 21:42:08
        PDT 2025; root:xnu-12377.1.9~141/RELEASE_ARM64_T8132 arm64","hostname":"hsc-m4-air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 03 Feb 2026 12:51:34 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '6356'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-<RPUSH_CONSUMER_FCM_FIREBASE_PROJECT_ID>';
        style-src 'self'; worker-src 'none'; upgrade-insecure-requests; report-uri
        https://q.stripe.com/csp-violation?q=jwMRpJU1ZbGdm1-aPtXBI8NNWmC6g21sdP5BEYkxyONxDCoKDJ_F95IABW7eZ1vesyzdyw-D3AJX07nw
      Request-Id:
      - req_WVhVFx5GKYt4TB
      Stripe-Account:
      - acct_1SksUmIK1urmCqcP
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "acct_1SksUmIK1urmCqcP",
          "object": "account",
          "business_profile": {
            "annual_revenue": null,
            "estimated_worker_count": null,
            "mcc": "5734",
            "minority_owned_business_designation": null,
            "name": null,
            "product_description": "Test product",
            "specified_commercial_transactions_act_url": null,
            "support_address": null,
            "support_email": null,
            "support_phone": null,
            "support_url": null,
            "url": "www.gumroad.com"
          },
          "business_type": "individual",
          "capabilities": {
            "affirm_payments": "active",
            "bancontact_payments": "active",
            "card_payments": "active",
            "cashapp_payments": "active",
            "eps_payments": "active",
            "ideal_payments": "active",
            "klarna_payments": "active",
            "link_payments": "active",
            "transfers": "active"
          },
          "charges_enabled": true,
          "company": {
            "address": {
              "city": "San Francisco",
              "country": "US",
              "line1": "address_full_match",
              "line2": null,
              "postal_code": "94107",
              "state": "CA"
            },
            "directors_provided": true,
            "executives_provided": true,
            "name": null,
            "owners_provided": true,
            "phone": "+10000000000",
            "tax_id_provided": false,
            "verification": {
              "document": {
                "back": null,
                "details": null,
                "details_code": null,
                "front": null
              }
            }
          },
          "controller": {
            "fees": {
              "payer": "application_custom"
            },
            "is_controller": true,
            "losses": {
              "payments": "application"
            },
            "requirement_collection": "application",
            "stripe_dashboard": {
              "type": "none"
            },
            "type": "application"
          },
          "country": "US",
          "created": 1767299362,
          "default_currency": "usd",
          "details_submitted": true,
          "email": null,
          "external_accounts": {
            "object": "list",
            "data": [
              {
                "id": "ba_1SksUmIK1urmCqcPOFE1FRDI",
                "object": "bank_account",
                "account": "acct_1SksUmIK1urmCqcP",
                "account_holder_name": null,
                "account_holder_type": null,
                "account_type": null,
                "available_payout_methods": [
                  "standard"
                ],
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "default_for_currency": true,
                "fingerprint": "xadKCGTmvYR41F1v",
                "future_requirements": {
                  "currently_due": [],
                  "errors": [],
                  "past_due": [],
                  "pending_verification": []
                },
                "last4": "6789",
                "metadata": {},
                "requirements": {
                  "currently_due": [],
                  "errors": [],
                  "past_due": [],
                  "pending_verification": []
                },
                "routing_number": "111000000",
                "status": "new"
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/accounts/acct_1SksUmIK1urmCqcP/external_accounts"
          },
          "future_requirements": {
            "alternatives": [],
            "current_deadline": 1765915200,
            "currently_due": [],
            "disabled_reason": null,
            "errors": [],
            "eventually_due": [],
            "past_due": [],
            "pending_verification": []
          },
          "individual": {
            "id": "person_1SksUnIK1urmCqcP98slmjQl",
            "object": "person",
            "account": "acct_1SksUmIK1urmCqcP",
            "address": {
              "city": "San Francisco",
              "country": "US",
              "line1": "address_full_match",
              "line2": null,
              "postal_code": "94107",
              "state": "CA"
            },
            "created": 1767299361,
            "dob": {
              "day": 1,
              "month": 1,
              "year": 1901
            },
            "email": "me@example.com",
            "first_name": "Chuck",
            "future_requirements": {
              "alternatives": [],
              "currently_due": [],
              "errors": [],
              "eventually_due": [],
              "past_due": [],
              "pending_verification": []
            },
            "id_number_provided": true,
            "last_name": "Bartowski",
            "metadata": {},
            "phone": "+10000000000",
            "relationship": {
              "authorizer": false,
              "director": false,
              "executive": false,
              "legal_guardian": false,
              "owner": false,
              "percent_ownership": null,
              "representative": true,
              "title": null
            },
            "requirements": {
              "alternatives": [],
              "currently_due": [],
              "errors": [],
              "eventually_due": [],
              "past_due": [],
              "pending_verification": []
            },
            "ssn_last_4_provided": true,
            "verification": {
              "additional_document": {
                "back": null,
                "details": null,
                "details_code": null,
                "front": null
              },
              "details": null,
              "details_code": null,
              "document": {
                "back": null,
                "details": null,
                "details_code": null,
                "front": "file_1SksUmIBOqvOFDrfp8XcDw94"
              },
              "status": "verified"
            }
          },
          "metadata": {},
          "payouts_enabled": true,
          "requirements": {
            "alternatives": [],
            "current_deadline": null,
            "currently_due": [],
            "disabled_reason": null,
            "errors": [],
            "eventually_due": [],
            "past_due": [],
            "pending_verification": []
          },
          "settings": {
            "bacs_debit_payments": {
              "display_name": null,
              "service_user_number": null
            },
            "branding": {
              "icon": null,
              "logo": null,
              "primary_color": null,
              "secondary_color": null
            },
            "card_issuing": {
              "tos_acceptance": {
                "date": null,
                "ip": null
              }
            },
            "card_payments": {
              "decline_on": {
                "avs_failure": false,
                "cvc_failure": false
              },
              "statement_descriptor_prefix": "GUMROAD.CO",
              "statement_descriptor_prefix_kana": null,
              "statement_descriptor_prefix_kanji": null
            },
            "dashboard": {
              "display_name": "Gumroad",
              "timezone": "Etc/UTC"
            },
            "invoices": {
              "default_account_tax_ids": null,
              "hosted_payment_method_save": "offer"
            },
            "payments": {
              "statement_descriptor": "GUMROAD.COM",
              "statement_descriptor_kana": null,
              "statement_descriptor_kanji": null
            },
            "payouts": {
              "debit_negative_balances": false,
              "schedule": {
                "delay_days": 2,
                "interval": "daily"
              },
              "statement_descriptor": null
            },
            "paypay_payments": {},
            "sepa_debit_payments": {}
          },
          "tos_acceptance": {
            "date": 1427846400,
            "ip": "54.234.242.13",
            "user_agent": null
          },
          "type": "custom"
        }
  recorded_at: Tue, 03 Feb 2026 12:51:34 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/payouts?limit=1
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/12.5.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_WVhVFx5GKYt4TB","request_duration_ms":889}}'
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"12.5.0","lang":"ruby","lang_version":"3.4.3 p32 (2025-04-14)","platform":"arm64-darwin25","engine":"ruby","publisher":"stripe","uname":"Darwin
        hsc-m4-air.local 25.0.0 Darwin Kernel Version 25.0.0: Wed Sep 17 21:42:08
        PDT 2025; root:xnu-12377.1.9~141/RELEASE_ARM64_T8132 arm64","hostname":"hsc-m4-air.local"}'
      Stripe-Account:
      - acct_1SksUmIK1urmCqcP
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 03 Feb 2026 12:51:35 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1073'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-<RPUSH_CONSUMER_FCM_FIREBASE_PROJECT_ID>';
        style-src 'self'; worker-src 'none'; upgrade-insecure-requests; report-uri
        https://q.stripe.com/csp-violation?q=6dMVZ_YmRnxChaWQ7eCxIQd-RLgU_HAqg3wDuZfizSRJRh_UC0m3LtxF0kZhqUWl_esUrcwUdUCleLj7
      Request-Id:
      - req_yWgEeaDNBLBnYU
      Stripe-Account:
      - acct_1SksUmIK1urmCqcP
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "po_1SwibmIK1urmCqcP8HhhLGHG",
              "object": "payout",
              "amount": 10000,
              "application_fee": null,
              "application_fee_amount": null,
              "arrival_date": 1770076800,
              "automatic": false,
              "balance_transaction": "txn_1SwibmIK1urmCqcPNNghuNGG",
              "created": 1770121290,
              "currency": "usd",
              "description": "test env",
              "destination": "ba_1SksUmIK1urmCqcPOFE1FRDI",
              "failure_balance_transaction": null,
              "failure_code": null,
              "failure_message": null,
              "livemode": false,
              "metadata": {},
              "method": "standard",
              "original_payout": null,
              "payout_method": null,
              "reconciliation_status": "not_applicable",
              "reversed_by": null,
              "source_type": "card",
              "statement_descriptor": "Gumroad",
              "status": "paid",
              "trace_id": {
                "status": "supported",
                "value": "7UF6L35Yd7187HF50T7ow7H97YB5LE4oy6we4kK19"
              },
              "type": "bank_account"
            }
          ],
          "has_more": true,
          "url": "/v1/payouts"
        }
  recorded_at: Tue, 03 Feb 2026 12:51:35 GMT
recorded_with: VCR 6.2.0
